Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/getting_married_abroad.html.txt.tmx
Source language: en
Languages: ga

source: If you or your partner are an Irish citizen(s) and are thinking of getting married outside of Ireland, you should realise that the legal validity of your marriage is governed, in part, by the laws of the country in which you marry
ga: Más saoránach/saoránaigh Éireannach(a) tú féin nó do pháirtí agus go bhfuil sibh ag smaoineamh pósadh lasmuigh d'Éirinn, ba chóir go mbeadh a fhios agat go bhfuil bailíocht dhlíthiúil an phósta rialaithe i bpáirt ag dlíthe na tíre ina bpósann tú

source: In most, if not all cases, the legal formalities abroad are very different to those in Ireland
ga: Tá na foirmiúlachtaí dlíthiúla thar lear an-difriúil ó na cinn in Éirinn ar an mórchuid, mura bhfuil agus i ngach cás

source: For example, a church marriage abroad is usually a purely religious ceremony with no legal effect
ga: Mar shampla, is iondúil gur searmanas reiligiúnach amháin gan aon éifeacht dhlíthiúil é pósadh eaglaise thar lear

source: Because it is not recognised in law in the country in which it takes place, it cannot be regarded as a legal marriage in Ireland
ga: Toisc nach bhfuil sé aitheanta de réir an dlí sa tír inar tharla sé, ní féidir breathnú air mar phósadh dlíthiúil in Éirinn

source: This is the case even though a marriage in the same church or denomination in Ireland can be legally binding
ga: Tá an cás amhlaidh cé gur féidir le pósadh san eaglais nó sainchreideamh chéanna in Éirinn a bheith ceangailtech de réir an dlí

source: It is very important, therefore, that you make sure to meet all the legal requirements of the country you are marrying in
ga: Dá réir sin, tá sé fíor-thábhachtach duit a chinntiú go sásaíonn tú riachtanais dlíthiúla na tíre ina bhfuil tú ag pósadh

source: You should contact the civil registration office in that country to find out what is required
ga: Ba chóir duit teagmháil a dhéanamh leis an oifig chlárúcháin sibhialta sa tír sin chun fáil amach cad atá riachtanach

source: Registration of marriages abroad
ga: Clárú na bpóstaí thar lear

source: Marriages of Irish citizens abroad are registered in the country where they occur
ga: Cláraítear póstaí saoránach Éireannach thar lear sa tír ina dtarlaíonn siad

source: The General Register Office has no function in advising on, or the registration of marriages of Irish citizens that take place abroad
ga: Níl feidhm ar bith ag Oifig an Ard-Chláraitheora chun comhairle a thabhairt ar phóstaí, nó póstaí saoránach Éireannach a tharlaíonn thar lear a chlárú

source: Marriages that take place outside the state are not normally registered in Ireland
ga: Ní chláraítear póstaí a tharlaíonn lasmuigh den stát in Éirinn de ghnáth

source: Your foreign marriage certificate will usually be accepted for official purposes in Ireland where you need to show evidence that you are married
ga: Is iondúil go nglacfar le do theastas pósta eachtrannach maidir le cuspóirí oifigiúla in Éirinn, nuair is gá duit fianaise a léiriú go bhfuil tú pósta

source: If the certificate is in a foreign language, you must provide an official translation or a translation from a recognised translation agency
ga: Má tá an teastas i dteanga eachtrannach, ní mór duit aistriúchán oifigiúil a chur ar fáil, nó aistriúchán ó ghníomhaireacht aistriúcháin aitheanta

source: Although you must meet the foreign requirements for formalities, you are still bound by Irish law as far as the capacity to marry is concerned
ga: Cé go gcaithfidh tú na riachtanais eachtrannacha a shásamh d'fhoirmiúlachtaí, tá tú fós faoi cheangal de réir dlí na hÉireann chomh fada agus a bhaineann le cumas pósta

source: For example, your marriage abroad will not be recognised under Irish law if one or both of you was ordinarily resident in Ireland and one or both of you was aged under 18 at the time of the marriage and did not have a Court Exemption Order
ga: Mar shampla, ní dhéanfar do phósadh thar lear a aithint de réir dlí na hÉireann má bhí duine amháin nó an bheirt agaibh cónaitheach in Éirinn de ghnáth, agus nach raibh duine amháin nó an bheirt agaibh faoi 18 bliana d'aois ag am an phósta, agus nach raibh Ordú Díolúine Cúirte agaibh

source: You may require a Certificate of Freedom to Marry to get married in some foreign countries
ga: D'fhéadfadh Deimhniú Saoirse le Pósadh a bheith de dhíth ort chun pósadh i dtíortha eachtrannacha

source: This may also be called "Certificate de Coutume" or "Certificate of Nulla Osta"
ga: D'fhéadfaí "Deimhniú de Coutume" nó "Deimhniú Nulla Osta" a thabhairt air chomh maith

source: If you are not sure of the legal requirements for marriage in the country you will be marrying in, contact the civil registration office in that country in advance to find out what is required
ga: Mura bhfuil tú cinnte maidir leis na riachtanais dlíthiúla a bhaineann leis an tír ina mbeidh tú ag pósadh, ba chóir duit teagmháil a dhéanamh leis an oifig chlárúcháin sibhialta sa tír sin chun fáil amach cad atá riachtanach

source: To apply for a Certificate of Freedom to Marry, Irish citizens living abroad should contact their nearest Irish embassy or apply online to the Department of Foreign Affairs and Trade
ga: Chun iarratas a dhéanamh ar Dheimhniú Saoirse le Pósadh, ba chóir do shaoránaigh Éireannacha atá ag cónaí thar lear teagmháil a dhéanamh le hambasáid nó iarratas a dhéanamh ar líne chuig an Roinn Gnóthaí Eachtracha agus Trádála is gaire

source: Irish citizens living in Ireland should apply online to the Department of Foreign Affairs and Trade
ga: Ba chóir do shaoránaigh Éireannacha atá ag cónaí in Éirinn iarratas a dhéanamh ar líne chuig an Roinn Gnóthaí Eachtracha agus Trádála

source: If you are getting married in Italy for example, your Certificate of Freedom to Marry will be sent by the Department to the Irish embassy in Rome who will then forward it to the district where you will be married
ga: Má tá tú ag pósadh san Iodáil mar shampla, déanfaidh an Roinn do Dheimhniú Saoirse le Pósadh a sheoladh chuig ambasáid na hÉireann sa Róimh, agus déanfaidh siad é a sheoladh ar aghaidh chuig an dúiche ina mbeidh tú ag pósadh

source: In most other cases, the Certificate of Freedom to Marry will be issued by the Department and sent directly to you
ga: I dtromlach na gcásanna eile, déanfaidh an Roinn an Deimhniú Saoirse le Pósadh a eisiúint agus a sheoladh díreach chugat

source: If you want to get a copy of your foreign marriage certificate, you should contact the embassy or the civil registration office for the country concerned
ga: Más mian leat cóip de do theastas pósta eachtrannach a fháil, ba chóir duit teagmháil a dhéanamh le hambasáid na tíre atá i gceist nó leis an oifig chlárúcháin sibhialta

source: Further information is available on the Department of Foreign Affairs and Trade website
ga: Is féidir leat tuilleadh eolais a fháil ar shuíomh gréasáin na Roinne Gnóthaí Eachtracha agus Trádála
